# DetailNumberDuplicate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..DetailNumberDuplicate Property
BuiltInFailures..::..ViewFailures Class See Also
---
Detail Number is already in use. Enter a unique number.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DetailNumberDuplicate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DetailNumberDuplicate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DetailNumberDuplicate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace